# -*- coding: utf-8 -*-
import sys; sys.path.insert(0,'tmp')
from reformat import run
E="https://t.pia.jp/pia/event/event.do?eventCd=%s"
updates=[
 {'id':635,'date':'2026-11-07','tickets':[{'type':'一般発売（大阪 11/7公演）6/27 10:00発売','startDate':'2026-06-27','date':'2026-06-27','url':E%'2613744'}]},
 {'id':636,'date':'2026-11-15','tickets':[
    {'type':'先行抽選（福岡 11/15公演）〜6/14 23:59','date':'2026-06-14','url':E%'2615297'},
    {'type':'一般発売（福岡 11/15公演）6/27 10:00発売','startDate':'2026-06-27','date':'2026-06-27','url':E%'2615297'}]},
 {'id':637,'date':'2026-11-28','tickets':[
    {'type':'プレリザーブ先行（兵庫 11/28公演）〜6/14 23:59','date':'2026-06-14','url':E%'2615195'},
    {'type':'一般発売（兵庫 11/28公演）6/27 10:00発売','startDate':'2026-06-27','date':'2026-06-27','url':E%'2615195'}]},
 {'id':638,'date':'2026-12-16','tickets':[
    {'type':'先行抽選（大阪 12/16公演）〜6/14 23:59','date':'2026-06-14','url':E%'2615298'},
    {'type':'一般発売（大阪 12/16公演）6/27 10:00発売','startDate':'2026-06-27','date':'2026-06-27','url':E%'2615298'}]},
 {'id':639,'date':'2026-12-26','tickets':[
    {'type':'先行抽選（岡山 12/26公演）〜6/14 23:59','date':'2026-06-14','url':E%'2615305'},
    {'type':'一般発売（岡山 12/26公演）6/27 10:00発売','startDate':'2026-06-27','date':'2026-06-27','url':E%'2615305'}]},
 {'id':640,'date':'2026-09-12','tickets':[{'type':'一般発売（埼玉 9/12公演）6/20 10:00発売','startDate':'2026-06-20','date':'2026-06-20','url':E%'2612463'}]},
]
run(updates)
